load-test/workflow-api.yml
config:
  target: http://localhost:3000
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 50
      name: "Ramp-up"
    
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: "Peak Load"
    
    # Stress test
    - duration: 60
      arrivalRate: 150
      name: "Stress Test"
  
  variables:
    authToken: "test_token_123"
    userId: "test_user_123"
  
  http:
    timeout: 30
    maxSockets: 50
  
  defaults:
    headers:
      Authorization: "Bearer {{authToken}}"
      Content-Type: "application/json"

scenarios:
  # Scenario 1: Get Workflows (Read-heavy)
  - name: "Get Workflows"
    weight: 40
    requests:
      - get:
          url: "/api/workflows"
          capture:
            - json: "$.workflows[0].id"
              as: "workflowId"

  # Scenario 2: Get Workflow Details
  - name: "Get Workflow Details"
    weight: 30
    requests:
      - get:
          url: "/api/workflows/{{workflowId}}"

  # Scenario 3: Get Dashboard Stats
  - name: "Get Dashboard Stats"
    weight: 20
    requests:
      - get:
          url: "/api/user/stats"

  # Scenario 4: Create Workflow (Write-heavy)
  - name: "Create Workflow"
    weight: 10
    requests:
      - post:
          url: "/api/workflows"
          json:
            name: "Load Test Workflow_{{ $randomString() }}"
            description: "Created during load test"
            trigger:
              type: "webhook"
              config:
                method: "POST"
                path: "/webhook/test"
            actions: []